interThermalPhaseFoam/BubblySGS/BubblySGS_NewTest/0/beta
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      beta;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    BotWall
    {
        type            fixedValue;
        value           uniform 0.1;
    }
    FreeStream
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
    FrontNBack
    {
        type            empty;
    }
    LeftSide
    {
        type            symmetryPlane;
    }
    RightSide
    {
        type            symmetryPlane;
    }
}


// ************************************************************************* //
